#+TITLE: ob-sclang
#+STARTUP: showall
#+STARTUP: showstars

* Some tests

The code blocks beyond this point can be executed from an org buffer:

Post some string to SC's Post Buffer:
#+begin_src sclang
"boo".postln;
#+end_src

This python code does not need to be evaluated beforehand because it will be evaluated by sclang block below.
#+name: frompy
#+begin_src python :session sc :results value
[1,2,3,4]
#+end_src

#+RESULTS: frompy
| 1 | 2 | 3 | 4 |

And we will use this table as input data
#+name: tbl
| boo  | 5 | 9 |
| good | 7 | xa |

And here we execute some sclang that simply reads variables specified in code block's header. They include named python codeblock above and the table.
#+begin_src sclang :var x=10 y=11 z=1.1 table=tbl tb=frompy
  x.postln;
  x.class.postln;
  y.postln;
  y.class.postln;
  z.postln;
  z.class.postln;
  table.postln;
  table.class.postln;
  table[0].postln;
  tb.postln;
  tb.class.postln;
#+end_src

And this is the output to SC's Post Buffer.
#+begin_example
10
Integer
11
Integer
1.1
Float
[ [ boo, 5, 9 ], [ good, 7, xa ] ]
Array
[ boo, 5, 9 ]
[ 1, 2, 3, 4 ]
Array
#+end_example

